---
title: DefinitionGroups
classe: Autodesk.Revit.DB.DefinitionGroups
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DefinitionGroups

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `definitionGroups.IsEmpty` | Boolean |
| `DefinitionGroup Item { get; }` | `definitionGroups.Item` | DefinitionGroup |
| `Int32 Size { get; }` | `definitionGroups.Size` | Int32 |
| `Boolean Contains(DefinitionGroup)` | `definitionGroups.Contains(definitionGroup)` | Boolean |
| `DefinitionGroup Create(String)` | `definitionGroups.Create(name)` | DefinitionGroup |
| `Void Dispose()` | `definitionGroups.Dispose()` | Void |
| `IEnumerator<DefinitionGroup> GetEnumerator()` | `definitionGroups.GetEnumerator()` | IEnumerator<DefinitionGroup> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```